interface Type {
  title: string;
  content: string;
  color?: string;
  manager_name?: string;
  qualification_number?: string;
  expert_group?: boolean;
  description?: string;
  resolution_conditions?: any[];
  expert_member?: any[];
  new_title?: string;
}

export const contract_special_terms: Type[] = [
  {
    title: '甲方委托乙方办理的工作：',
    content:
      '1: 除办理土地征用、搬迁补偿外，办理平整施工场地等工作，使施工场地具备施工条件，并在开工后继续负责解决上述工作遗留的问题； \n 2: 开通施工场地与城乡公共道路间的通道，满足施工运输的需要； \n 3: 协助办理规划、开工备案（施工许可证）、土地征用、搬迁补偿以及占道施工、路灯、市政道路、水土保持、绿化、停水、停电、中断道路交通、爆破作业等的批件；\n 4: 处理施工场地周围地下管线和邻近建筑物、构筑物(包括文物保护建筑)、古树名木等的保护工作。',
  },
  {
    title: '项目经理/负责人的任命：',
    content:
      '承包人的项目经理与投标文件的承诺不一致的，按相关规定进行处理，同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为；③处1万元每天的违约金；④情节特别严重的，或经督办后15天仍未到位的，发包人有权解除合同。',
    color: '#D9001B',
    manager_name: '',
    qualification_number: '',
  },
  {
    title: '项目经理、技术负责人等的在场时间和更换：',
    content:
      '(1）承包人投入本工程的项目经理、技术负责人、安全主任、质量主任和专职安全员自合同签订之日起应专职于本工程工作，若发包人发现在其他项目有任职的，发包人有权视为承包人严重违约。项目经理、技术负责人必须常驻施工现场，法定工作日期间必须在现场，由监理人/发包人进行考核，若考核不合格，发包人有权按承包人违约处理。如在实施危大工程期间或黄色及以上等级气象预警，项目经理不得离开工地。承包人更换项目经理或项目技术负责人应取得发包人的书面同意，且不得低于原项目经理或技术负责人资历（指执业资格、职称、工作年限、学历等）。除死亡、离职（注：自批准离职之日始1个月后3年之内，当发包人或行政主管部门在官方网站上查验发现，该离职人员的注册单位或社保缴纳单位仍为原单位时，按承包人向发包人或行政主管部门提供虚假信息处理）、刑拘、重病或者重伤（持有三甲医院证明）两个月以上不能履职、非承包人原因工地持续停工六个月以上等情况外，更换项目经理或技术负责人（包括发包人要求更换的）的，第一次更换项目经理或技术负责人（包括发包人要求更换的），每次处合同价 0.2% 的违约金（不高于200万元，不低于20万元；高于200万元的按以200万元计，低于20万元的以20万元计）；再次更换项目经理或技术负责人（包括发包人要求更换的），每次处合同价 0.4% 的违约金（不高于200万元，不低于20万元；高于200万元的按以200万元计，低于20万元的以20万元计）。\n (2)承包人未经监理工程师及发包人同意更换项目经理的，按相关规定进行处理，同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为,在正式批准的人员到岗之前每天认定一次,以累计情况认定最终不良定位等级；③处1万元每天的违约金；④情节特别严重的，或经督办后15天仍未到位的，发包人有权解除合同。\n (3)承包人无正当理由拒绝更换项目经理的违约责任：发包人或监理人要求更换的,一周内必须到岗,不到岗的按相关规定进行处理，同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为；③处1万元每天的违约金；④情节特别严重的，经督办后15天仍未到位的，发包人有权解除合同。',
  },
  {
    title: '承包人原因导致工期延误：',
    content:
      '逾期竣工违约金计算方法：因承包人的原因造成工期延误，发包人对承包人的工期延误进行履约评价，同时发包人对承包人工期每延误一天处：□1万元；□2万元；□5万元; □其他     /日历天，最多不超过合同价的5%。\n 逾期竣工违约金的上限：/',
  },
  {
    title: '工程量计算：',
    content:
      '(1)本项目工程量均以工程结算时核实的工程量为准；\n (2)如工程量清单中所列项目实际未发生时，其工程量由清单中扣除；\n (3)若发包人提供的工程量清单漏项，其工程量以实际施工设计图纸为准，按实际发生的工程量进行计算，项目单价按通用条款第25款和专用条款第25款工程变更价款确定；\n (4)若施工图纸与工程量清单存在量差，其工程量以实际施工设计图纸为准，按实际发生的工程量进行计算，项目单价不作调整；\n (5)由于设计变更引起的工程量变化或由于发包人、监理和（或）政府审计部门认可的现场工程量确认引起的工程量变化，可以调整工程量大小。项目单价的确定方法按通用条款第25款和专用条款第25款工程变更价款确定；\n (6)由于承包人的原因导致的工程量变化，若工程量增加的，不予调整。若工程量减少的，则予以调整。',
  },
  {
    title: '工程变更引起措施项目的调整：',
    content:
      '工程变更引起措施项目费调整的，其调整方法为：增减30万以内的不予调整，30万元以上按（附件）合同通用条款25.2款执行。',
  },
  {
    title: '承包人专家组：',
    content:
      '12.1承包人应承诺针对本项目成立专家组，发包人有权根据实际需要要求承包人专家组成员进驻现场；当项目生产管理不能满足合同要求时或在重大施工节点期间，发包人有权要求承包人专家组成员进驻现场支持管理，必要时全面主持项目技术管理工作；若不能按发包人要求进驻现场，视为承包人违约。专家组成员约定如下：',

    expert_group: true,
    description:
      '说明：\n （1）组长须由承包人总工程师或分管副总工程师担任，成员可由承包人本部专家或外聘专家担任。\n （2）组员具有10年以上（含10年）类似水利水电工程施工工作经验，必须是高级或以上技术职称，并根据工程进展情况到达现场。\n （3）当专家组组长发生变更时，应将变更情况书面通知监理人和发包人。\n 12.2承包人专家组义务：协调调动承包人内部、外部技术力量，为项目实施提供技术支撑；协调解决项目实施过程中遇到的重大技术问题；负责组织对监理人或发包人提供的施工图（包括送审稿）进行专家会审，并形成书面会审意见向监理人和发包人反馈；负责组织对施工图、施工组织设计和专项施工方案进行审查，并形成书面审查意见向监理人和发包人反馈；根据发包人要求，进驻现场、参与或全面主持项目技术管理工作；专家组履行被发包人约谈的义务，并协调、落实约谈事项；发包人要求履行的其它义务。',

    color: '#D9001B',
  },
  {
    title: '争优创优：',
    content:
      '□（1）工程质量符合合格验收标准，创建深圳市优质工程奖或深圳市优质工程金牛奖，给予承包人追加本工程签约合同价中列支的工程创优奖励金额的30%作为奖励。若未获得相应市级奖项，则处以扣除违约金    万元的处罚。\n □（2）工程质量符合合格验收标准，创建广东优质水利工程奖或广东市政金奖等省级奖励，给予承包人追加本工程签约合同价中列支的工程创优奖励金额的60%作为奖励。若未获得广东优质水利工程奖（工程设计已获得广东省水利水电行业协会颁发的优秀水利工程勘测设计奖）或广东市政金奖等省级奖项，违约金为     万元。\n □（3）项目获得国家级优质工程奖励、大禹奖、詹天佑奖或鲁班奖等，给予承包人追加本工程签约合同价中列支的工程创优奖励金额的100%作为奖励。若未获得相应国家级奖项，则处以扣除违约金    万元的处罚。\n 说明：如同时取得市级、省级优质工程奖项，奖励金额以省级奖励为准；如同时取得市级、省级和国家级优质工程奖项，奖励金额以国家级奖励为准，不重复计算。\n □（4）获得深圳市水务工程质量安全评估年度质量安全综合得分排名第一名奖励    万元、第二名奖励    万元、第三名奖励   万元、第四名奖励   万元、第五名奖励   万元。若在深圳市水务工程质量安全评估年度质量安全综合得分排名中倒数第一名的处违约金    万元、倒数第二名的处违约金    万元、倒数第三名的处违约金    万元、倒数第四名的处违约金   万元、倒数第五名的处违约金    万元。\n □（5）承包人档案管理应符合“广东省重大建设项目档案金册奖”相关要求，并无条件配合发包人开展“广东省重大建设项目档案金册奖”申报工作。',
  },
  {
    title: '实名制管理：',
    content:
      '（1）对施工现场实名管理工作负总责，对分包人实施统一管理，监督其按时足额支付作业工人工资，督促其落实实名管理制度。\n （2）指定专人负责开展实名管理数据的采集、登记、审核、报送和档案管理等工作。在项目施工现场设立信息采集点，对首次进入施工现场人员采集个人实名管理信息。各类管理台账应当保存至工程竣工且工资全部结清后至少2年。\n （3）建立现场人员进出场登记制度。在施工现场人员进场后5日内，承包人要向发包人或者受其委托的监理单位报送实名登记信息资料并实时更新，实行动态监管。现场人员退场时，承包人应当为其办理退场登记，填报登记退场日期、用工评价或者诚信记录，并按劳动合同约定结清相关费用。\n （4）承包人应当在现场设置公示牌，将每月经施工现场人员确认的考勤与工资支付信息在公示牌上进行公示，公示期不少于5日。\n （5）承包人在完成实名信息采集后，应当为作业工人统一办理银行卡，用于发放作业工人工资。承包人应当根据考勤记录、劳动合同、薪酬约定等编制作业工人的工资表，经作业工人本人签字确认并在施工现场公示后，委托银行从工资支付专用账户将工资直接划入作业工人的工资卡。\n （6）承包人落实《广东省建设工程领域用工实名管理暂行办法》的其它有关规定。',
  },
  {
    title: '违约与索赔：',
    content:
      '发包人违约 \n 发包人违约责任的承担方式和计算方法：\n (1)因发包人原因未能在计划开工日期前7天内下达开工通知的违约责任：\n 工期可以顺延，费用不予补偿。\n (2)因发包人原因未能按合同约定支付合同价款的违约责任：\n 承包人应充分考虑因政府财政资金未及时到位而导致发包人不能按时支付合同价款的风险，在项目资金无法按本合同约定支付时，仍应筹措资金继续开展各项施工工作，未经发包人允许不可随意停工，并应自行承担由此引起的劳务、材料、设备、资金等一切纠纷以及因此而发生的费用。\n (3)发包人提供的材料、工程设备的规格、数量或质量不符合合同约定，或因发包人原因导致交货日期延误或交货地点变更等情况的违约责任：\n 工期可以顺延，费用不予补偿。\n (4)因发包人违反合同约定造成暂停施工的违约责任：\n 暂停施工期连续在6个月（含本数）内的，工期顺延，但承包人不得主张任何费用赔偿或补偿，工程全面停工超过6个月，且存在下列情况的，可予以补偿：\n ①对于留在现场的工程材料，承包人应安排人员妥善照管，自全面停工第7个月起，照管费用由发包人承担。\n ②对于已经进场且按发包人要求不进行退场的施工机械设备，自全面停工第7个月起，补偿机械窝工及维护费。\n (5)发包人无正当理由没有在约定期限内发出复工指示，导致承包人无法复工的违约责任：工期可以顺延，费用不予补偿。\n (6)发包人明确表示或其行为表明不履行合同主要义务的违约责任：\n 工期可以顺延，费用不予补偿。\n (7)其他：发包人保留根据工程实际情况对实际开工、中间停工、复工及竣工日期做出调整的权力，承包人须服从安排，工期可以顺延，费用不予补偿。\n 承包人违约 \n (1)承包人违反合同约定进行转包或违法分包的违约责任：\n 承包人应无条件改正，并承担由此给发包人带来的一切损失。同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为；③处以分包合同价5%的违约金。\n (2)承包人违反合同约定采购和使用不合格的材料和工程设备的违约责任：\n 承包人应无条件拆除不合格的材料和工程设备，办理材料设备退场，并承担由此给发包人带来的一切损失。同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为；③处10万元的违约金。\n (3)因承包人原因导致工程质量不符合合同要求的违约责任：\n 限期返工、整改以达到合格的标准，并承担由此给发包人带来的一切损失。同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为；③处10万元的违约金。\n (4)承包人未经批准，私自将已按照合同约定进入施工现场的材料或设备撤离施工现场的违约责任：\n 承包人应无条件改正，并承担由此给发包人带来的一切损失。同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为；③处10万元的违约金。\n (5)承包人未能按施工进度计划及时完成合同约定的工作，造成工期延误的违约责任：\n 合同工期拖延1个月（含本数）以上3个月以内的，同时视情况给予下列之一（或全部）处罚：①承包人不能获得良好及以上的履约评价；②报请主管部门认定不良行为。\n 合同工期拖延3个月（含本数）以上6个月以内的，同时视情况给予下列之一（或全部）处罚：①承包人不能获得中等及以上的履约评价；②报请主管部门认定不良行为。\n 合同工期拖延6个月以上的，按相关规定进行处理，同时视情况给予下列之一（或全部）处罚：①承包人履约评价不合格；②报请主管部门认定不良行为。\n (6)承包人在缺陷责任期及保修期内，未能在合理期限对工程缺陷进行修复，或拒绝按发包人要求进行修复的违约责任：\n 发包人可以直接委托其他单位进行修复，并从质量保证金中扣除该笔费用。同时视情况给予下列之一（或全部）处罚：①承包人不能获得良好及以上的履约评价；②报请主管部门认定不良行为。\n (7)承包人明确表示或其行为表明不履行合同主要义务的违约责任：\n 视情况给予下列之一（或全部）处罚：①承包人不能获得良好及以上的履约评价；②报请主管部门认定不良行为；③解除合同。',
  },
  {
    title: '争议解决：',
    content:
      '争议的解决方式 \n (1)发包人与承包人共同指定的调解机构为：深圳市水务局。\n (2)发包人或承包人一方不愿调解或调解不成的，应采用下列方式之一解决争议（注：只能选择一种方式，在选定的方式前的“□”内打“√”）：',

    resolution_conditions: [
      '提交深圳仲裁委员会仲裁； \n',
      '提交华南国际经济贸易仲裁委员会（又称“深圳国际仲裁院”）仲裁；\n',
      '向有管辖权的人民法院提起诉讼。',
    ],
  },
];
