const ChooseIcon = () => (
  <svg
    width="24px"
    height="18px"
    viewBox="0 0 24 18"
    version="1.1"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
  >
    <g
      id="检查计划"
      stroke="none"
      strokeWidth="1"
      fill="none"
      fillRule="evenodd"
    >
      <g
        id="添加人员"
        transform="translate(-934.000000, -248.000000)"
        fill="#FFFFFF"
        fillRule="nonzero"
      >
        <g id="编组" transform="translate(930.000000, 243.000000)">
          <g transform="translate(4.000000, 5.364413)" id="路径">
            <path d="M1.6782395,7.6711012 L7.30598512,12.0302773 C7.30598512,12.0302773 7.61640904,12.1859219 8.00443893,12.0302773 L21.8610426,0.425733208 C21.8610426,0.425733208 23.8356836,0.00353788558 23.4693984,2.10549162 C22.132851,3.46756968 8.50906525,16.6232962 8.50906525,16.6232962 C8.50906525,16.6232962 7.61640904,17.1293291 6.76236837,16.6232962 C5.90907751,15.7668751 0.204475726,9.50048895 0.204475726,9.50048895 C0.204475726,9.50048895 0.0481390441,7.98276631 1.6782395,7.6711012 Z"></path>
          </g>
        </g>
      </g>
    </g>
  </svg>
);

export default ChooseIcon;
